// полезный инструмент для рисования в копилку https://omerk.github.io/lcdchargen/

#include "print3x5.h"

static const uint8_t font3x5[][3] PROGMEM = {
    {
        0b11111,
        0b10001,
        0b11111,
    },
    {
        0b11111,
        0b00000,
        0b00000,
    },
    {
        0b11101,
        0b10101,
        0b10111,
    },
    {
        0b11111,
        0b10101,
        0b10101,
    },
    {
        0b11111,
        0b00100,
        0b11100,
    },
    {
        0b10111,
        0b10101,
        0b11101,
    },
    {
        0b10111,
        0b10101,
        0b11111,
    },
    {
        0b11111,
        0b10000,
        0b10000,
    },
    {
        0b11111,
        0b10101,
        0b11111,
    },
    {
        0b11111,
        0b10101,
        0b11101,
    },
};

void printDig(GyverGFX* mx, int X, int Y, uint8_t dig) {
    if (dig > 9) return;
    for (uint8_t x = 0; x < 3; x++) {
        uint8_t col = pgm_read_byte(&font3x5[dig][x]);
        for (uint8_t y = 0; y < 5; y++) {
            if (bitRead(col, 4 - y)) mx->dot(X + 2 - x, Y + y);
        }
    }
}

static const uint8_t icons[][8] PROGMEM = {
    // 0 громкость
    {
        0b00000000,
        0b00000000,
        0b11111111,
        0b01000010,
        0b00100100,
        0b00111100,
        0b00111100,
        0b00000000
    },
    // 1 мелодия
    {
        0b00000000,
        0b11100000,
        0b10100000,
        0b11111111,
        0b00000010,
        0b00000100,
        0b00000000,
        0b00000000 
    },
    // 2 яркость
    {
        0b00111100,
        0b01000010,
        0b10000001,
        0b10000001,
        0b11111111,
        0b11111111,
        0b01111110,
        0b00111100  
    },
    // 3 анимация окончания
    {
        0b00000000,
        0b00000000,
        0b11001000,
        0b00101011,
        0b00111111,
        0b01001000,
        0b01001000,
        0b00000000  
    },
    // 4 батарейка пустая
    {
        0b00111100,
        0b00100100,
        0b00100100,
        0b00100100,
        0b00100100,
        0b00100100,
        0b00111100,
        0b00011000  
    },
    // 5 летящая нота (темп)
    {
        0b11100000,
        0b10100000,
        0b11111111,
        0b00000010,
        0b10000100,
        0b10100000,
        0b10101000,
        0b00101000,
    },
    // 6 полупустая батарейка
    {
        0b00111100,
        0b00111100,
        0b00111100,
        0b00100100,
        0b00100100,
        0b00100100,
        0b00111100,
        0b00011000  
    },
};

void printIcon(GyverGFX* mx, int X, int Y, uint8_t icon) {
    for (uint8_t x = 0; x < 8; x++) {
        uint8_t col = pgm_read_byte(&icons[icon][x]);
        for (uint8_t y = 0; y < 8; y++) {
            if (bitRead(col, y)) mx->dot(X + x, Y + y);
        }
    }
}